app/graphql/mutations/add_teams_tournament.rb

  def resolve(teams_names:, tournament_id:)
    tournament = Tournament.find(tournament_id)
    teams_to_save = []

    teams_names.each do |name|
      teams_to_save << Team.new(name: name, tournament: tournament)
---
SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "teams" ("tournament_id", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["tournament_id", 2], ["name", "Copan Dry"], ["created_at", "2023-07-26 17:06:36.996225"], ["updated_at", "2023-07-26 17:06:36.996225"]]