app/graphql/mutations/create_tournament.rb

INSERT INTO "tournaments" ("name", "start_date", "end_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "2019"], ["start_date", "2019-01-01 00:00:00 -0600"], ["end_date", "2019-01-01 00:00:00 -0600"], ["created_at", "2023-07-26 16:47:24.856229"], ["updated_at", "2023-07-26 16:47:24.856229"]]
---
  def resolve(name:, start_date:, end_date:)
    tournament = Tournament.new(name: name, start_date: start_date, end_date: end_date)

    if tournament.save