app/graphql/mutations/update_tournament_name.rb

SELECT "tournaments".* FROM "tournaments" WHERE "tournaments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tournaments" SET "name" = ?, "updated_at" = ? WHERE "tournaments"."id" = ?  [["name", "Torneo Nato Dubon (2019)"], ["updated_at", "2023-07-26 19:01:30.072457"], ["id", 1]]
---
  def resolve(tournament_id:, new_name:)
    tournament = Tournament.find(tournament_id)

    tournament.name = new_name

    if tournament.save