app/graphql/mutations/update_team_name.rb

  def resolve(team_id:, new_name:)
    team = Team.find(team_id)

    team.name = new_name

    if team.save
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "teams" SET "name" = ?, "updated_at" = ? WHERE "teams"."id" = ?  [["name", "Ocotepeque"], ["updated_at", "2023-07-26 18:44:10.773540"], ["id", 10]]