app/graphql/types/query_type.rb

    def teams_by_tournament(tournament_id:)
      teams = Team.where(tournament_id: tournament_id).includes(team_players: [:player])
---
SELECT "teams".* FROM "teams" WHERE "teams"."tournament_id" = ? LIMIT ?  [["tournament_id", 1], ["LIMIT", 1]]

    def team(id:)
      Team.find(id).includes(team_players: [:player])
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

    def team_by_name(name:)
      Team.find_by(name: :name).includes(team_players: [:player])
---
SELECT "teams".* FROM "teams" WHERE "teams"."name" = ? LIMIT ?  [["name", "name"], ["LIMIT", 1]]